ArduCAM/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/cs.xml
<module id="CS" HW_revision=""><register id="KEY" width="32" offset="0x0" internal="0" description="Key Register"><bitfield id="KEY" description="Write CSKEY = xxxx_695Ah to unlock CSCTL0, CSCTL1, CSCTL2, CSCT" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="CTL0" width="32" offset="0x4" internal="0" description="Control 0 Register"><bitfield id="DCOTUNE" description="DCO frequency tuning select" begin="12" end="0" width="13" rwaccess="R/W"/><bitfield id="DCORSEL" description="DCO frequency range select" begin="18" end="16" width="3" rwaccess="R/W"><bitenum id="DCORSEL__0" value="0" description="Nominal DCO Frequency Range (MHz): 1 to 2"/><bitenum id="DCORSEL__1" value="1" description="Nominal DCO Frequency Range (MHz): 2 to 4"/><bitenum id="DCORSEL__2" value="2" description="Nominal DCO Frequency Range (MHz): 4 to 8"/><bitenum id="DCORSEL__3" value="3" description="Nominal DCO Frequency Range (MHz): 8 to 16"/><bitenum id="DCORSEL__4" value="4" description="Nominal DCO Frequency Range (MHz): 16 to 32"/><bitenum id="DCORSEL__5" value="5" description="Nominal DCO Frequency Range (MHz): 32 to 64"/></bitfield><bitfield id="DCORES" description="Enables the DCO external resistor mode." begin="22" end="22" width="1" rwaccess="R/W"><bitenum id="DCORES__0" value="0" description="Internal resistor mode"/><bitenum id="DCORES__1" value="1" description="External resistor mode"/></bitfield><bitfield id="DCOEN" description="Enables the DCO oscillator regardless if used as a clock resour" begin="23" end="23" width="1" rwaccess="R/W"><bitenum id="DCOEN__0" value="0" description="DCO is on if it is used as a source for MCLK, HSMCLK , or SMCLK"/><bitenum id="DCOEN__1" value="1" description="DCO is on"/></bitfield><bitfield id="DIS_DCO_DELAY_CNT" description="Setting this bit disabes the DCO settling counter value" begin="24" end="24" width="1" rwaccess="R/W"><bitenum id="DIS_DCO_DELAY_CNT__0" value="0" description="DCO Settling delay counter is enabled"/><bitenum id="DIS_DCO_DELAY_CNT__1" value="1" description="DCO setlling delay counter disabled"/></bitfield></register><register id="CTL1" width="32" offset="0x8" internal="0" description="Control 1 Register"><bitfield id="SELM" description="Selects the MCLK source.&#13;&#10;" begin="2" end="0" width="3" rwaccess="R/W"><bitenum id="SELM__0" value="0" description="when LFXT available, otherwise REFOCLK"/><bitenum id="SELM__1" value="1" description=""/><bitenum id="SELM__2" value="2" description=""/><bitenum id="SELM__3" value="3" description=""/><bitenum id="SELM__4" value="4" description=""/><bitenum id="SELM__5" value="5" description="when HFXT available, otherwise DCOCLK"/><bitenum id="SELM__6" value="6" description="when HFXT2 available, otherwise DCOCLK"/><bitenum id="SELM__7" value="7" description="for future use"/></bitfield><bitfield id="SELS" description="Selects the SMCLK and HSMCLK source.&#13;&#10;" begin="6" end="4" width="3" rwaccess="R/W"><bitenum id="SELS__0" value="0" description="when LFXT available, otherwise REFOCLK"/><bitenum id="SELS__1" value="1" description=""/><bitenum id="SELS__2" value="2" description=""/><bitenum id="SELS__3" value="3" description=""/><bitenum id="SELS__4" value="4" description=""/><bitenum id="SELS__5" value="5" description="when HFXT available, otherwise DCOCLK"/><bitenum id="SELS__6" value="6" description="when HFXT2 available, otherwise DCOCLK"/><bitenum id="SELS__7" value="7" description="for furture use"/></bitfield><bitfield id="SELA" description="Selects the ACLK source.&#13;&#10;" begin="10" end="8" width="3" rwaccess="R/W"><bitenum id="SELA__0" value="0" description="when LFXT available, otherwise REFOCLK"/><bitenum id="SELA__1" value="1" description=""/><bitenum id="SELA__2" value="2" description=""/><bitenum id="SELA__3" value="3" description="for future use"/><bitenum id="SELA__4" value="4" description="for future use"/><bitenum id="SELA__5" value="5" description="for future use"/><bitenum id="SELA__6" value="6" description="for future use"/><bitenum id="SELA__7" value="7" description="for future use"/></bitfield><bitfield id="SELB" description="Selects the BCLK source." begin="12" end="12" width="1" rwaccess="R/W"><bitenum id="SELB__0" value="0" description="LFXTCLK"/><bitenum id="SELB__1" value="1" description="REFOCLK"/></bitfield><bitfield id="DIVM" description="MCLK source divider." begin="18" end="16" width="3" rwaccess="R/W"><bitenum id="DIVM__0" value="0" description="f(MCLK)/1"/><bitenum id="DIVM__1" value="1" description="f(MCLK)/2"/><bitenum id="DIVM__2" value="2" description="f(MCLK)/4"/><bitenum id="DIVM__3" value="3" description="f(MCLK)/8"/><bitenum id="DIVM__4" value="4" description="f(MCLK)/16"/><bitenum id="DIVM__5" value="5" description="f(MCLK)/32"/><bitenum id="DIVM__6" value="6" description="f(MCLK)/64"/><bitenum id="DIVM__7" value="7" description="f(MCLK)/128"/></bitfield><bitfield id="DIVHS" description="HSMCLK source divider." begin="22" end="20" width="3" rwaccess="R/W"><bitenum id="DIVHS__0" value="0" description="f(HSMCLK)/1"/><bitenum id="DIVHS__1" value="1" description="f(HSMCLK)/2"/><bitenum id="DIVHS__2" value="2" description="f(HSMCLK)/4"/><bitenum id="DIVHS__3" value="3" description="f(HSMCLK)/8"/><bitenum id="DIVHS__4" value="4" description="f(HSMCLK)/16"/><bitenum id="DIVHS__5" value="5" description="f(HSMCLK)/32"/><bitenum id="DIVHS__6" value="6" description="f(HSMCLK)/64"/><bitenum id="DIVHS__7" value="7" description="f(HSMCLK)/128"/></bitfield><bitfield id="DIVA" description="ACLK source divider." begin="26" end="24" width="3" rwaccess="R/W"><bitenum id="DIVA__0" value="0" description="f(ACLK)/1"/><bitenum id="DIVA__1" value="1" description="f(ACLK)/2"/><bitenum id="DIVA__2" value="2" description="f(ACLK)/4"/><bitenum id="DIVA__3" value="3" description="f(ACLK)/8"/><bitenum id="DIVA__4" value="4" description="f(ACLK)/16"/><bitenum id="DIVA__5" value="5" description="f(ACLK)/32"/><bitenum id="DIVA__6" value="6" description="f(ACLK)/64"/><bitenum id="DIVA__7" value="7" description="f(ACLK)/128"/></bitfield><bitfield id="DIVS" description="SMCLK source divider." begin="30" end="28" width="3" rwaccess="R/W"><bitenum id="DIVS__0" value="0" description="f(SMCLK)/1"/><bitenum id="DIVS__1" value="1" description="f(SMCLK)/2"/><bitenum id="DIVS__2" value="2" description="f(SMCLK)/4"/><bitenum id="DIVS__3" value="3" description="f(SMCLK)/8"/><bitenum id="DIVS__4" value="4" description="f(SMCLK)/16"/><bitenum id="DIVS__5" value="5" description="f(SMCLK)/32"/><bitenum id="DIVS__6" value="6" description="f(SMCLK)/64"/><bitenum id="DIVS__7" value="7" description="f(SMCLK)/128"/></bitfield></register><register id="CTL2" width="32" offset="0xC" internal="0" description="Control 2 Register"><bitfield id="LFXTDRIVE" description="The LFXT oscillator current can be adjusted to its drive needs" begin="2" end="0" width="3" rwaccess="R/W"><bitenum id="LFXTDRIVE__0" value="0" description="Lowest current consumption."/><bitenum id="LFXTDRIVE__1" value="1" description="Increased drive strength LFXT oscillator."/><bitenum id="LFXTDRIVE__2" value="2" description="Increased drive strength LFXT oscillator."/><bitenum id="LFXTDRIVE__3" value="3" description="Increased drive strength LFXT oscillator."/><bitenum id="LFXTDRIVE__4" value="4" description="Increased drive strength LFXT oscillator."/><bitenum id="LFXTDRIVE__5" value="5" description="Increased drive strength LFXT oscillator."/><bitenum id="LFXTDRIVE__6" value="6" description="Increased drive strength LFXT oscillator."/><bitenum id="LFXTDRIVE__7" value="7" description="Maximum drive strength LFXT oscillator."/></bitfield><bitfield id="LFXTAGCOFF" description="LFXT AGC off" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="LFXTAGCOFF__0" value="0" description="AGC enabled."/><bitenum id="LFXTAGCOFF__1" value="1" description="AGC disabled."/></bitfield><bitfield id="LFXT_EN" description="Turns on the LFXT oscillator regardless if used as a clock reso" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="LFXT_EN__0" value="0" description="LFXT is on if it is used as a source for ACLK, MCLK, HSMCLK , o"/><bitenum id="LFXT_EN__1" value="1" description="LFXT is on if LFXT is selected via the port selection and LFXT "/></bitfield><bitfield id="LFXTBYPASS" description="LFXT bypass select." begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="LFXTBYPASS__0" value="0" description="LFXT sourced by external crystal."/><bitenum id="LFXTBYPASS__1" value="1" description="LFXT sourced by external square wave."/></bitfield><bitfield id="HFXTDRIVE" description="HFXT oscillator drive selection" begin="16" end="16" width="1" rwaccess="R/W"><bitenum id="HFXTDRIVE__0" value="0" description="To be used for HFXTFREQ setting 000b"/><bitenum id="HFXTDRIVE__1" value="1" description="To be used for HFXTFREQ settings 001b to 111b"/></bitfield><bitfield id="HFXTFREQ" description="The HFXT frequency selection" begin="22" end="20" width="3" rwaccess="R/W"><bitenum id="HFXTFREQ__0" value="0" description="1 MHz to 4 MHz"/><bitenum id="HFXTFREQ__1" value="1" description="&gt;4 MHz to 8 MHz"/><bitenum id="HFXTFREQ__2" value="2" description="&gt;8 MHz to 16 MHz"/><bitenum id="HFXTFREQ__3" value="3" description="&gt;16 MHz to 24 MHz"/><bitenum id="HFXTFREQ__4" value="4" description="&gt;24 MHz to 32 MHz"/><bitenum id="HFXTFREQ__5" value="5" description="&gt;32 MHz to 40 MHz"/><bitenum id="HFXTFREQ__6" value="6" description="&gt;40 MHz to 48 MHz"/></bitfield><bitfield id="HFXT_EN" description="Turns on the HFXT oscillator regardless if used as a clock reso" begin="24" end="24" width="1" rwaccess="R/W"><bitenum id="HFXT_EN__0" value="0" description="HFXT is on if it is used as a source for MCLK, HSMCLK , or SMCL"/><bitenum id="HFXT_EN__1" value="1" description="HFXT is on if HFXT is selected via the port selection and HFXT "/></bitfield><bitfield id="HFXTBYPASS" description="HFXT bypass select." begin="25" end="25" width="1" rwaccess="R/W"><bitenum id="HFXTBYPASS__0" value="0" description="HFXT sourced by external crystal."/><bitenum id="HFXTBYPASS__1" value="1" description="HFXT sourced by external square wave."/></bitfield></register><register id="CTL3" width="32" offset="0x10" internal="0" description="Control 3 Register"><bitfield id="FCNTLF" description="Start flag counter for LFXT" begin="1" end="0" width="2" rwaccess="R/W"><bitenum id="FCNTLF__0" value="0" description="4096 cycles"/><bitenum id="FCNTLF__1" value="1" description="8192 cycles"/><bitenum id="FCNTLF__2" value="2" description="16384 cycles"/><bitenum id="FCNTLF__3" value="3" description="32768 cycles"/></bitfield><bitfield id="RFCNTLF" description="Reset start fault counter for LFXT" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="RFCNTLF__0" value="0" description="Not applicable. Always reads as zero due to self clearing."/><bitenum id="RFCNTLF__1" value="1" description="Restarts the counter immediately."/></bitfield><bitfield id="FCNTLF_EN" description="Enable start fault counter for LFXT" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="FCNTLF_EN__0" value="0" description="Startup fault counter disabled. Counter is cleared."/><bitenum id="FCNTLF_EN__1" value="1" description="Startup fault counter enabled."/></bitfield><bitfield id="FCNTHF" description="Start flag counter for HFXT" begin="5" end="4" width="2" rwaccess="R/W"><bitenum id="FCNTHF__0" value="0" description="2048 cycles"/><bitenum id="FCNTHF__1" value="1" description="4096 cycles"/><bitenum id="FCNTHF__2" value="2" description="8192 cycles"/><bitenum id="FCNTHF__3" value="3" description="16384 cycles"/></bitfield><bitfield id="RFCNTHF" description="Reset start fault counter for HFXT" begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="RFCNTHF__0" value="0" description="Not applicable. Always reads as zero due to self clearing."/><bitenum id="RFCNTHF__1" value="1" description="Restarts the counter immediately."/></bitfield><bitfield id="FCNTHF_EN" description="Enable start fault counter for HFXT" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="FCNTHF_EN__0" value="0" description="Startup fault counter disabled. Counter is cleared."/><bitenum id="FCNTHF_EN__1" value="1" description="Startup fault counter enabled."/></bitfield><bitfield id="FCNTHF2" description="Start flag counter for HFXT2" begin="9" end="8" width="2" rwaccess="R/W"><bitenum id="FCNTHF2__0" value="0" description="2048 cycles"/><bitenum id="FCNTHF2__1" value="1" description="4096 cycles"/><bitenum id="FCNTHF2__2" value="2" description="8192 cycles"/><bitenum id="FCNTHF2__3" value="3" description="16384 cycles"/></bitfield><bitfield id="RFCNTHF2" description="Reset start fault counter for HFXT2" begin="10" end="10" width="1" rwaccess="R/W"><bitenum id="RFCNTHF2__0" value="0" description="Not applicable. Always reads as zero due to self clearing."/><bitenum id="RFCNTHF2__1" value="1" description="Restarts the counter immediately."/></bitfield><bitfield id="FCNTHF2_EN" description="Enable start fault counter for HFXT2" begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="FCNTHF2_EN__0" value="0" description="Startup fault counter disabled. Counter is cleared."/><bitenum id="FCNTHF2_EN__1" value="1" description="Startup fault counter enabled."/></bitfield></register><register id="CTL4" width="32" offset="0x14" internal="0" description="Control 4 Register"><bitfield id="HFXT2DRIVE" description="The HFXT2 oscillator current can be adjusted to its drive needs" begin="2" end="0" width="3" rwaccess="R/W"><bitenum id="HFXT2DRIVE__0" value="0" description="Lowest current consumption"/><bitenum id="HFXT2DRIVE__1" value="1" description="Increased drive strength HFXT2 oscillator"/><bitenum id="HFXT2DRIVE__2" value="2" description="Increased drive strength HFXT2 oscillator"/><bitenum id="HFXT2DRIVE__3" value="3" description="Increased drive strength HFXT2 oscillator"/><bitenum id="HFXT2DRIVE__4" value="4" description="Increased drive strength HFXT2 oscillator"/><bitenum id="HFXT2DRIVE__5" value="5" description="Increased drive strength HFXT2 oscillator"/><bitenum id="HFXT2DRIVE__6" value="6" description="Increased drive strength HFXT2 oscillator"/><bitenum id="HFXT2DRIVE__7" value="7" description="Maximum drive strength HFXT2 oscillator"/></bitfield><bitfield id="HFXT2FREQ" description="The HFXT2 frequency selection" begin="6" end="4" width="3" rwaccess="R/W"/><bitfield id="HFXT2_EN" description="Turns on the HFXT2 oscillator regardless if used as a clock res" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="HFXT2BYPASS" description="HFXT2 bypass select" begin="9" end="9" width="1" rwaccess="R/W"/></register><register id="CTL5" width="32" offset="0x18" internal="0" description="Control 5 Register"><bitfield id="REFCNTSEL" description="Reference counter source select" begin="2" end="0" width="3" rwaccess="R/W"/><bitfield id="REFCNTPS" description="Reference clock prescaler&#13;&#10;000b = /1&#13;&#10;001b = /16&#13;&#10;010b = /32&#13;&#10;0" begin="5" end="3" width="3" rwaccess="R/W"/><bitfield id="CALSTART" description="Start clock calibration counters" begin="7" end="7" width="1" rwaccess="R/W"/><bitfield id="PERCNTSEL" description="Period counter source select" begin="10" end="8" width="3" rwaccess="R/W"/></register><register id="CTL6" width="32" offset="0x1C" internal="0" description="Control 6 Register"><bitfield id="PERCNT" description="Calibration period counter. Read only." begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="CTL7" width="32" offset="0x20" internal="0" description="Control 7 Register"><bitfield id="REFCNT" description="Calibration reference period counter." begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="CLKEN" width="32" offset="0x30" internal="0" description="Clock Enable Register"><bitfield id="ACLK_EN" description="ACLK system clock conditional request enable." begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="ACLK_EN__0" value="0" description="ACLK disabled regardless of conditional clock requests"/><bitenum id="ACLK_EN__1" value="1" description="ACLK enabled based on any conditional clock requests"/></bitfield><bitfield id="MCLK_EN" description="MCLK system clock conditional request enable" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="MCLK_EN__0" value="0" description="MCLK disabled regardless of conditional clock requests"/><bitenum id="MCLK_EN__1" value="1" description="MCLK enabled based on any conditional clock requests"/></bitfield><bitfield id="HSMCLK_EN" description="HSMCLK system clock conditional request enable." begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="HSMCLK_EN__0" value="0" description="HSMCLK disabled regardless of conditional clock requests"/><bitenum id="HSMCLK_EN__1" value="1" description="HSMCLK enabled based on any conditional clock requests"/></bitfield><bitfield id="SMCLK_EN" description="SMCLK system clock conditional request enable." begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="SMCLK_EN__0" value="0" description="SMCLK disabled regardless of conditional clock requests."/><bitenum id="SMCLK_EN__1" value="1" description="SMCLK enabled based on any conditional clock requests"/></bitfield><bitfield id="VLO_EN" description="Turns on the VLO oscillator regardless if used as a clock resou" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="VLO_EN__0" value="0" description="VLO is on only if it is used as a source for ACLK, MCLK, HSMCLK"/><bitenum id="VLO_EN__1" value="1" description="VLO is on"/></bitfield><bitfield id="REFO_EN" description="Turns on the REFO oscillator regardless if used as a clock reso" begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="REFO_EN__0" value="0" description="REFO is on only if it is used as a source for ACLK, MCLK, HSMCL"/><bitenum id="REFO_EN__1" value="1" description="REFO is on"/></bitfield><bitfield id="MODOSC_EN" description="Turns on the MODOSC oscillator regardless if used as a clock re" begin="10" end="10" width="1" rwaccess="R/W"><bitenum id="MODOSC_EN__0" value="0" description="MODOSC is on only if it is used as a source for ACLK, MCLK, HSM"/><bitenum id="MODOSC_EN__1" value="1" description="MODOSC is on"/></bitfield><bitfield id="REFOFSEL" description="Selects REFO nominal frequency." begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="REFOFSEL__0" value="0" description="32 kHz"/><bitenum id="REFOFSEL__1" value="1" description="128 kHz"/></bitfield></register><register id="STAT" width="32" offset="0x34" internal="0" description="Status Register"><bitfield id="DCO_ON" description="DCO status" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="DCO_ON__0" value="0" description="Inactive"/><bitenum id="DCO_ON__1" value="1" description="Active"/></bitfield><bitfield id="DCOBIAS_ON" description="DCO bias status" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="DCOBIAS_ON__0" value="0" description="Inactive"/><bitenum id="DCOBIAS_ON__1" value="1" description="Active"/></bitfield><bitfield id="HFXT_ON" description="HFXT status. Only available on devices with HFXT." begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="HFXT_ON__0" value="0" description="Inactive"/><bitenum id="HFXT_ON__1" value="1" description="Active"/></bitfield><bitfield id="HFXT2_ON" description="HFXT2 status. Only available on devices with HFXT2." begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="HFXT2_ON__0" value="0" description="Inactive"/><bitenum id="HFXT2_ON__1" value="1" description="Active"/></bitfield><bitfield id="MODOSC_ON" description="MODOSC status" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="MODOSC_ON__0" value="0" description="Inactive"/><bitenum id="MODOSC_ON__1" value="1" description="Active"/></bitfield><bitfield id="VLO_ON" description="VLO status" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="VLO_ON__0" value="0" description="Inactive"/><bitenum id="VLO_ON__1" value="1" description="Active"/></bitfield><bitfield id="LFXT_ON" description="LFXT status. Only available on devices with LFXT." begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="LFXT_ON__0" value="0" description="Inactive"/><bitenum id="LFXT_ON__1" value="1" description="Active"/></bitfield><bitfield id="REFO_ON" description="REFO status" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="REFO_ON__0" value="0" description="Inactive"/><bitenum id="REFO_ON__1" value="1" description="Active"/></bitfield><bitfield id="ACLK_ON" description="ACLK system clock status" begin="16" end="16" width="1" rwaccess="R/W"><bitenum id="ACLK_ON__0" value="0" description="Inactive"/><bitenum id="ACLK_ON__1" value="1" description="Active"/></bitfield><bitfield id="MCLK_ON" description="MCLK system clock status" begin="17" end="17" width="1" rwaccess="R/W"><bitenum id="MCLK_ON__0" value="0" description="Inactive"/><bitenum id="MCLK_ON__1" value="1" description="Active"/></bitfield><bitfield id="HSMCLK_ON" description="HSMCLK system clock status" begin="18" end="18" width="1" rwaccess="R/W"><bitenum id="HSMCLK_ON__0" value="0" description="Inactive"/><bitenum id="HSMCLK_ON__1" value="1" description="Active"/></bitfield><bitfield id="SMCLK_ON" description="SMCLK system clock status" begin="19" end="19" width="1" rwaccess="R/W"><bitenum id="SMCLK_ON__0" value="0" description="Inactive"/><bitenum id="SMCLK_ON__1" value="1" description="Active"/></bitfield><bitfield id="MODCLK_ON" description="MODCLK system clock status" begin="20" end="20" width="1" rwaccess="R/W"><bitenum id="MODCLK_ON__0" value="0" description="Inactive"/><bitenum id="MODCLK_ON__1" value="1" description="Active"/></bitfield><bitfield id="VLOCLK_ON" description="VLOCLK system clock status" begin="21" end="21" width="1" rwaccess="R/W"><bitenum id="VLOCLK_ON__0" value="0" description="Inactive"/><bitenum id="VLOCLK_ON__1" value="1" description="Active"/></bitfield><bitfield id="LFXTCLK_ON" description="LFXTCLK system clock status" begin="22" end="22" width="1" rwaccess="R/W"><bitenum id="LFXTCLK_ON__0" value="0" description="Inactive"/><bitenum id="LFXTCLK_ON__1" value="1" description="Active"/></bitfield><bitfield id="REFOCLK_ON" description="REFOCLK system clock status" begin="23" end="23" width="1" rwaccess="R/W"><bitenum id="REFOCLK_ON__0" value="0" description="Inactive"/><bitenum id="REFOCLK_ON__1" value="1" description="Active"/></bitfield><bitfield id="ACLK_READY" description="ACLK Ready status" begin="24" end="24" width="1" rwaccess="R/W"><bitenum id="ACLK_READY__0" value="0" description="Not ready"/><bitenum id="ACLK_READY__1" value="1" description="Ready"/></bitfield><bitfield id="MCLK_READY" description="MCLK Ready status" begin="25" end="25" width="1" rwaccess="R/W"><bitenum id="MCLK_READY__0" value="0" description="Not ready"/><bitenum id="MCLK_READY__1" value="1" description="Ready"/></bitfield><bitfield id="HSMCLK_READY" description="HSMCLK Ready status" begin="26" end="26" width="1" rwaccess="R/W"><bitenum id="HSMCLK_READY__0" value="0" description="Not ready"/><bitenum id="HSMCLK_READY__1" value="1" description="Ready"/></bitfield><bitfield id="SMCLK_READY" description="SMCLK Ready status" begin="27" end="27" width="1" rwaccess="R/W"><bitenum id="SMCLK_READY__0" value="0" description="Not ready"/><bitenum id="SMCLK_READY__1" value="1" description="Ready"/></bitfield><bitfield id="BCLK_READY" description="BCLK Ready status" begin="28" end="28" width="1" rwaccess="R/W"><bitenum id="BCLK_READY__0" value="0" description="Not ready"/><bitenum id="BCLK_READY__1" value="1" description="Ready"/></bitfield></register><register id="IE" width="32" offset="0x40" internal="0" description="Interrupt Enable Register"><bitfield id="LFXTIE" description="LFXT oscillator fault flag interrupt enable" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="LFXTIE__0" value="0" description="Interrupt disabled"/><bitenum id="LFXTIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="HFXTIE" description="HFXT oscillator fault flag inte