ArduCAM/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/cs.xml
rrupt enable" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="HFXTIE__0" value="0" description="Interrupt disabled"/><bitenum id="HFXTIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="HFXT2IE" description="HFXT2 oscillator fault flag interrupt enable" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="HFXT2IE__0" value="0" description="Interrupt disabled"/><bitenum id="HFXT2IE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="DCOMINIE" description="DCO minimum fault flag interrupt enable." begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="DCOMINIE__0" value="0" description="Interrupt disabled"/><bitenum id="DCOMINIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="DCOMAXIE" description="DCO maximum fault flag interrupt enable." begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="DCOMAXIE__0" value="0" description="Interrupt disabled"/><bitenum id="DCOMAXIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="DCORIE" description="DCO external resistor fault flag interrupt enable." begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="DCORIE__0" value="0" description="Interrupt disabled"/><bitenum id="DCORIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="FCNTLFIE" description="Start fault counter interrupt enable LFXT" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="FCNTLFIE__0" value="0" description="Interrupt disabled"/><bitenum id="FCNTLFIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="FCNTHFIE" description="Start fault counter interrupt enable HFXT" begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="FCNTHFIE__0" value="0" description="Interrupt disabled"/><bitenum id="FCNTHFIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="FCNTHF2IE" description="Start fault counter interrupt enable HFXT2" begin="10" end="10" width="1" rwaccess="R/W"><bitenum id="FCNTHF2IE__0" value="0" description="Interrupt disabled"/><bitenum id="FCNTHF2IE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="PLLOOLIE" description="PLL out-of-lock interrupt enable" begin="12" end="12" width="1" rwaccess="R/W"><bitenum id="PLLOOLIE__0" value="0" description="Interrupt disabled"/><bitenum id="PLLOOLIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="PLLLOSIE" description="PLL loss-of-signal interrupt enable" begin="13" end="13" width="1" rwaccess="R/W"><bitenum id="PLLLOSIE__0" value="0" description="Interrupt disabled"/><bitenum id="PLLLOSIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="PLLOORIE" description="PLL out-of-range interrupt enable" begin="14" end="14" width="1" rwaccess="R/W"><bitenum id="PLLOORIE__0" value="0" description="Interrupt disabled"/><bitenum id="PLLOORIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="CALIE" description="REFCNT period counter interrupt enable." begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="CALIE__0" value="0" description="Interrupt disabled"/><bitenum id="CALIE__1" value="1" description="Interrupt enabled"/></bitfield></register><register id="IFG" width="32" offset="0x48" internal="0" description="Interrupt Flag Register"><bitfield id="LFXTIFG" description="LFXT oscillator fault flag" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="LFXTIFG__0" value="0" description="No fault condition occurred after the last reset"/><bitenum id="LFXTIFG__1" value="1" description="LFXT fault. A LFXT fault occurred after the last reset"/></bitfield><bitfield id="HFXTIFG" description="HFXT oscillator fault flag" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="HFXTIFG__0" value="0" description="No fault condition occurred after the last reset"/><bitenum id="HFXTIFG__1" value="1" description="HFXT fault. A HFXT fault occurred after the last reset"/></bitfield><bitfield id="HFXT2IFG" description="HFXT2 oscillator fault flag" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="HFXT2IFG__0" value="0" description="No fault condition occurred after the last reset"/><bitenum id="HFXT2IFG__1" value="1" description="HFXT2 fault. A HFXT2 fault occurred after the last reset"/></bitfield><bitfield id="DCOMINIFG" description="DCO minimum fault flag" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="DCOMINIFG__0" value="0" description="DCO frequency not at minimum setting of the current DCORSEL set"/><bitenum id="DCOMINIFG__1" value="1" description="DCO frequency at minimum setting of the current DCORSEL setting"/></bitfield><bitfield id="DCOMAXIFG" description="DCO maximum fault flag" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="DCOMAXIFG__0" value="0" description="DCO frequency not at maximum setting of the current DCORSEL set"/><bitenum id="DCOMAXIFG__1" value="1" description="DCO frequency at maximum setting of the current DCORSEL setting"/></bitfield><bitfield id="DCORIFG" description="DCO external resistor fault flag" begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="DCORIFG__0" value="0" description="DCO external resistor present"/><bitenum id="DCORIFG__1" value="1" description="DCO external resistor fault"/></bitfield><bitfield id="FCNTLFIFG" description="Start fault counter interrupt flag LFXT" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="FCNTLFIFG__0" value="0" description="Start counter not expired"/><bitenum id="FCNTLFIFG__1" value="1" description="Start counter expired"/></bitfield><bitfield id="FCNTHFIFG" description="Start fault counter interrupt flag HFXT" begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="FCNTHFIFG__0" value="0" description="Start counter not expired"/><bitenum id="FCNTHFIFG__1" value="1" description="Start counter expired"/></bitfield><bitfield id="FCNTHF2IFG" description="Start fault counter interrupt flag HFXT2" begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="FCNTHF2IFG__0" value="0" description="Start counter not expired"/><bitenum id="FCNTHF2IFG__1" value="1" description="Start counter expired"/></bitfield><bitfield id="PLLOOLIFG" description="PLL out-of-lock interrupt flag" begin="12" end="12" width="1" rwaccess="R/W"><bitenum id="PLLOOLIFG__0" value="0" description="No interrupt pending"/><bitenum id="PLLOOLIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="PLLLOSIFG" description="PLL loss-of-signal interrupt flag" begin="13" end="13" width="1" rwaccess="R/W"><bitenum id="PLLLOSIFG__0" value="0" description="No interrupt pending"/><bitenum id="PLLLOSIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="PLLOORIFG" description="PLL out-of-range interrupt flag" begin="14" end="14" width="1" rwaccess="R/W"><bitenum id="PLLOORIFG__0" value="0" description="No interrupt pending"/><bitenum id="PLLOORIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="CALIFG" description="REFCNT period counter expired" begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="CALIFG__0" value="0" description="REFCNT period counter not expired"/><bitenum id="CALIFG__1" value="1" description="REFCNT period counter expired"/></bitfield></register><register id="CLRIFG" width="32" offset="0x50" internal="0" description="Clear Interrupt Flag Register"><bitfield id="CLR_LFXTIFG" description="Clear LFXT oscillator fault interrupt flag" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="CLR_LFXTIFG__0" value="0" description="No effect"/><bitenum id="CLR_LFXTIFG__1" value="1" description="Clear pending interrupt flag"/></bitfield><bitfield id="CLR_HFXTIFG" description="Clear HFXT oscillator fault interrupt flag" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="CLR_HFXTIFG__0" value="0" description="No effect"/><bitenum id="CLR_HFXTIFG__1" value="1" description="Clear pending interrupt flag"/></bitfield><bitfield id="CLR_HFXT2IFG" description="Clear HFXT2 oscillator fault interrupt flag" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="CLR_HFXT2IFG__0" value="0" description="No effect"/><bitenum id="CLR_HFXT2IFG__1" value="1" description="Clear pending interrupt flag"/></bitfield><bitfield id="CLR_DCOMINIFG" description="Clear DCO minimum fault interrupt flag. Does not clear OFIFG." begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="CLR_DCOMINIFG__0" value="0" description="No effect"/><bitenum id="CLR_DCOMINIFG__1" value="1" description="Clear pending interrupt flag"/></bitfield><bitfield id="CLR_DCOMAXIFG" description="Clear DCO maximum fault interrupt flag. Does not clear OFIFG." begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="CLR_DCOMAXIFG__0" value="0" description="No effect"/><bitenum id="CLR_DCOMAXIFG__1" value="1" description="Clear pending interrupt flag"/></bitfield><bitfield id="CLR_DCORIFG" description="Clear DCO external resistor fault interrupt flag" begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="CLR_DCORIFG__0" value="0" description="No effect"/><bitenum id="CLR_DCORIFG__1" value="1" description="Clear pending interrupt flag"/></bitfield><bitfield id="CLR_CALIFG" description="REFCNT period counter clear interrupt flag" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="CLR_CALIFG__0" value="0" description="No effect"/><bitenum id="CLR_CALIFG__1" value="1" description="Clear pending interrupt flag"/></bitfield><bitfield id="CLR_FCNTLFIFG" description="Start fault counter clear interrupt flag LFXT" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="CLR_FCNTLFIFG__0" value="0" description="No effect"/><bitenum id="CLR_FCNTLFIFG__1" value="1" description="Clear pending interrupt flag"/></bitfield><bitfield id="CLR_FCNTHFIFG" description="Start fault counter clear interrupt flag HFXT" begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="CLR_FCNTHFIFG__0" value="0" description="No effect"/><bitenum id="CLR_FCNTHFIFG__1" value="1" description="Clear pending interrupt flag"/></bitfield><bitfield id="CLR_FCNTHF2IFG" description="Start fault counter clear interrupt flag HFXT2" begin="10" end="10" width="1" rwaccess="R/W"><bitenum id="CLR_FCNTHF2IFG__0" value="0" description="No effect"/><bitenum id="CLR_FCNTHF2IFG__1" value="1" description="Clear pending interrupt flag"/></bitfield><bitfield id="CLR_PLLOOLIFG" description="PLL out-of-lock clear interrupt flag" begin="12" end="12" width="1" rwaccess="R/W"><bitenum id="CLR_PLLOOLIFG__0" value="0" description="No effect"/><bitenum id="CLR_PLLOOLIFG__1" value="1" description="Clear pending interrupt flag"/></bitfield><bitfield id="CLR_PLLLOSIFG" description="PLL loss-of-signal clear interrupt flag" begin="13" end="13" width="1" rwaccess="R/W"><bitenum id="CLR_PLLLOSIFG__0" value="0" description="No effect"/><bitenum id="CLR_PLLLOSIFG__1" value="1" description="Clear pending interrupt flag"/></bitfield><bitfield id="CLR_PLLOORIFG" description="PLL out-of-range clear interrupt flag" begin="14" end="14" width="1" rwaccess="R/W"><bitenum id="CLR_PLLOORIFG__0" value="0" description="No effect"/><bitenum id="CLR_PLLOORIFG__1" value="1" description="Clear pending interrupt flag"/></bitfield></register><register id="SETIFG" width="32" offset="0x58" internal="0" description="Set Interrupt Flag Register"><bitfield id="SET_LFXTIFG" description="Set LFXT oscillator fault interrupt flag" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="SET_LFXTIFG__0" value="0" description="No effect"/><bitenum id="SET_LFXTIFG__1" value="1" description="Set pending interrupt flag"/></bitfield><bitfield id="SET_HFXTIFG" description="Set HFXT oscillator fault interrupt flag" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="SET_HFXTIFG__0" value="0" description="No effect"/><bitenum id="SET_HFXTIFG__1" value="1" description="Set pending interrupt flag"/></bitfield><bitfield id="SET_HFXT2IFG" description="Set HFXT2 oscillator fault interrupt flag" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="SET_HFXT2IFG__0" value="0" description="No effect"/><bitenum id="SET_HFXT2IFG__1" value="1" description="Set pending interrupt flag"/></bitfield><bitfield id="SET_DCOMINIFG" description="Set DCO minimum fault interrupt flag." begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="SET_DCOMINIFG__0" value="0" description="No effect"/><bitenum id="SET_DCOMINIFG__1" value="1" description="Set pending interrupt flag"/></bitfield><bitfield id="SET_DCOMAXIFG" description="Set DCO maximum fault interrupt flag." begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="SET_DCOMAXIFG__0" value="0" description="No effect"/><bitenum id="SET_DCOMAXIFG__1" value="1" description="Set pending interrupt flag"/></bitfield><bitfield id="SET_DCORIFG" description="Set DCO external resistor fault interrupt flag." begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="SET_DCORIFG__0" value="0" description="No effect"/><bitenum id="SET_DCORIFG__1" value="1" description="Set pending interrupt flag"/></bitfield><bitfield id="SET_CALIFG" description="REFCNT period counter set interrupt flag. expired." begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="SET_CALIFG__0" value="0" description="No effect"/><bitenum id="SET_CALIFG__1" value="1" description="Set pending interrupt flag"/></bitfield><bitfield id="SET_FCNTLFIFG" description="Start fault counter set interrupt flag LFXT" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="SET_FCNTLFIFG__0" value="0" description="No effect"/><bitenum id="SET_FCNTLFIFG__1" value="1" description="Set pending interrupt flag"/></bitfield><bitfield id="SET_FCNTHFIFG" description="Start fault counter set interrupt flag HFXT" begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="SET_FCNTHFIFG__0" value="0" description="No effect"/><bitenum id="SET_FCNTHFIFG__1" value="1" description="Set pending interrupt flag"/></bitfield><bitfield id="SET_FCNTHF2IFG" description="NOTE: This bit is reserved for HFXT2 implementations" begin="10" end="10" width="1" rwaccess="R/W"><bitenum id="SET_FCNTHF2IFG__0" value="0" description="No effect"/><bitenum id="SET_FCNTHF2IFG__1" value="1" description="Set pending interrupt flag"/></bitfield><bitfield id="SET_PLLOOLIFG" description="NOTE: This bit is reserved for PLL implementations" begin="12" end="12" width="1" rwaccess="R/W"><bitenum id="SET_PLLOOLIFG__0" value="0" description="No effect"/><bitenum id="SET_PLLOOLIFG__1" value="1" description="Set pending interrupt flag"/></bitfield><bitfield id="SET_PLLLOSIFG" description="NOTE: This bit is reserved for PLL implementations" begin="13" end="13" width="1" rwaccess="R/W"><bitenum id="SET_PLLLOSIFG__0" value="0" description="No effect"/><bitenum id="SET_PLLLOSIFG__1" value="1" description="Set pending interrupt flag"/></bitfield><bitfield id="SET_PLLOORIFG" description="NOTE: This bit is reserved for PLL implementations" begin="14" end="14" width="1" rwaccess="R/W"><bitenum id="SET_PLLOORIFG__0" value="0" description="No effect"/><bitenum id="SET_PLLOORIFG__1" value="1" description="Set pending interrupt flag"/></bitfield></register><register id="DCOERCAL" width="32" offset="0x60" internal="0" description="DCO external resistor cailbration register"><bitfield id="DCO_TCTRIM" description="DCO Temperature compensation Trim" begin="1" end="0" width="2" rwaccess="R/W"/><bitfield id="DCO_FTRIM" description="DCO frequency trim" begin="26" end="16" width="11" rwaccess="R/W"/></register></module>